//Задание 1
let a = 10;
alert(a);
a = 20;
alert(a);

//Задание 2 (выпуск первого iphone 29 июня 2007 г.)
let age = 2007;
alert(` Задание 2 \n В ${age} году был выпущен первый iphone`)

//Задание 3
const name = "Брендан Эйх";
alert(` Задание 3 \n ${name} автор языка программирования JavaScript` );

//Задание 4
let q = 10;
let w = 2;
let sum = q + w;
let dif = q - w;
let prod = q * w;
let quot = q / w;
alert(` Задание 4 \n Сумма ${q} + ${w} = ${sum} \n Разность ${q} - ${w} = ${dif} \n Произведение ${q} * ${w} = ${prod} \n Частное ${q} / ${w} = ${quot}`);

//Задание 5
let e = 2;
alert(` Задание 5 \n Возводим число ${e} в пятую степень, получаем число ${e ** 5}`);

//Задание 6
a = 9;
let b = 2;
alert(` Задание 6 \n Остаток от деления чисел ${a} и ${b} равняется числу ${a % b}`);

//Задание 7
let num = 1;
num += 5;
num -= 3;
num *= 7;
num /= 3;
num ++;
num --;
alert(` Задание 7 \n Ответ: ${num}`);

//Задание 8
age = prompt("Сколько вам лет?")
alert(`Если вам верить, то ваш возраст составляет ${age} лет(года)`)

//Задание 9 
const user = {
name: "Jone",
age: 666,
"isAdmin": true
}

//Задание 10
const r = prompt("Как вас зовут?");
alert(`Привет, ${r}`)
